# Pandas Tutorial Concise Version

In [2]:
#import pandas

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Object Creation -  Series

Creating a Series by passing a list of values, letting pandas create a default integer index:


class pandas.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)

One-dimensional ndarray with axis labels (including time series).

Labels need not be unique but must be a hashable type. The object supports both integer- and label-based indexing and provides a host of methods for performing operations involving the index. Statistical methods from ndarray have been overridden to automatically exclude missing data (currently represented as NaN).

Operations between Series (+, -, /, , *) align values based on their associated index values– they need not be the same length. The result index will be the sorted union of the two indexes.
    
Parameters:	

data : array-like, dict, or scalar value: Contains data stored in Series

index : array-like or Index (1d): Values must be hashable and have the same length as data. Non-unique index values are allowed. Will default to RangeIndex(len(data)) if not provided. If both a dict and index sequence are used, the index will override the keys found in the dict.

dtype : numpy.dtype or None: If None, dtype will be inferred

copy : boolean, default False: Copy input data


For more refer: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.html#pandas.Series

In [4]:
?pd.Series

In [5]:
s = pd.Series([1,3,5,np.nan,6,8])

In [6]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [7]:
ind1=["India","Pakistan","Bangladesh","srilanka","china","nepal"]

s2 = pd.Series([1,3,5,np.nan,6,8], index=ind1)
print(s2)

India         1.0
Pakistan      3.0
Bangladesh    5.0
srilanka      NaN
china         6.0
nepal         8.0
dtype: float64

## Object Creation - DataFrame

pandas.DataFrame

class pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)

Two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). Arithmetic operations align on both row and column labels. Can be thought of as a dict-like container for Series objects. The primary pandas data structure
    
  
Parameters:	

data : numpy ndarray (structured or homogeneous), dict, or DataFrame: Dict can contain Series, arrays, constants, or list-like objects

index : Index or array-like: Index to use for resulting frame. Will default to np.arange(n) if no indexing information part of input data and no index provided

columns : Index or array-like: Column labels to use for resulting frame. Will default to np.arange(n) if no column labels are provided

dtype : dtype, default None: Data type to force. Only a single dtype is allowed. If None, infer

copy : boolean, default False: Copy data from inputs. Only affects DataFrame / 2d ndarray input

For more refer: https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html#pandas.DataFrame

Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns:

In [8]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [9]:
np.random.randn(6,4)

array([[-1.18392466,  0.24865366, -0.57067145,  1.61297391],
       [-1.42098433, -0.05465934, -0.44442712, -0.33745443],
       [-1.1085317 ,  0.26147061, -2.43646499,  0.36890717],
       [-1.96420626, -0.02269681,  1.41333752, -1.76881477],
       [ 0.97467815,  0.69796255,  0.21902109, -0.95971998],
       [-1.25721809, -0.52179473,  0.42492617,  0.2560211 ]])

In [97]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.430836  0.462817 -1.112833  0.477462
2013-01-02 -0.407161 -0.332588  1.365704  0.178716
2013-01-03 -0.670012  0.518603 -1.183840 -2.611754
2013-01-04 -2.195315 -0.335308  0.263239 -0.638686
2013-01-05  0.590392 -1.424858 -0.187574 -0.852506
2013-01-06 -1.188601  0.547093 -0.782680 -0.550550

In [11]:
dict1={'a':"john",'b':[0,1], "c":["foo","bar"]}

In [12]:
df01=pd.DataFrame(dict1)

In [13]:
df01

      a  b    c
0  john  0  foo
1  john  1  bar

Creating a `DataFrame` by passing a dict of objects that can be converted to series-like.

In [14]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [15]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Having specific [dtypes](http://pandas.pydata.org/pandas-docs/stable/basics.html#basics-dtypes)

In [16]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

If you’re using IPython, tab completion for column names (as well as public attributes) is automatically enabled. Here’s a subset of the attributes that will be completed:

```
df2.<TAB>

df2.A                  df2.boxplot
df2.abs                df2.C
df2.add                df2.clip
df2.add_prefix         df2.clip_lower
df2.add_suffix         df2.clip_upper
df2.align              df2.columns
df2.all                df2.combine
df2.any                df2.combineAdd
df2.append             df2.combine_first
df2.apply              df2.combineMult
df2.applymap           df2.compound
df2.as_blocks          df2.consolidate
df2.asfreq             df2.convert_objects
df2.as_matrix          df2.copy
df2.astype             df2.corr
df2.at                 df2.corrwith
df2.at_time            df2.count
df2.axes               df2.cov
df2.B                  df2.cummax
df2.between_time       df2.cummin
df2.bfill              df2.cumprod
df2.blocks             df2.cumsum
df2.bool               df2.D
```

As you can see, the columns A, B, C, and D are automatically tab completed. E is there as well; the rest of the attributes have been truncated for brevity.

## Viewing Data

Seeing the top & bottom rows of the frame

In [17]:
df.head(3)

                   A         B         C         D
2013-01-01 -0.067575  0.038042  0.688557 -0.521715
2013-01-02 -0.839044  1.502348  0.511833 -0.807464
2013-01-03 -1.250384  0.602624 -0.179216  2.030134

In [18]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.161289 -0.374724 -0.222458  0.650898
2013-01-05  0.421133  0.285023  0.854098  1.183830
2013-01-06  0.135148  0.883823  1.399645 -2.291368

Display the index, columns, and the underlying numpy data

In [19]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [20]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [21]:
df.values

array([[-0.06757528,  0.03804231,  0.68855675, -0.52171524],
       [-0.83904404,  1.50234757,  0.51183276, -0.80746439],
       [-1.25038411,  0.60262376, -0.17921634,  2.03013363],
       [ 0.16128925, -0.37472386, -0.22245758,  0.6508979 ],
       [ 0.42113279,  0.28502312,  0.85409831,  1.18382996],
       [ 0.13514799,  0.88382278,  1.39964502, -2.29136804]])

Describe shows a quick statistic summary of your data

In [22]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.239906  0.489523  0.508743  0.040719
std    0.655488  0.661310  0.625022  1.556353
min   -1.250384 -0.374724 -0.222458 -2.291368
25%   -0.646177  0.099788 -0.006454 -0.736027
50%    0.033786  0.443823  0.600195  0.064591
75%    0.154754  0.813523  0.812713  1.050597
max    0.421133  1.502348  1.399645  2.030134

Transposing your data

In [23]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.067575   -0.839044   -1.250384    0.161289    0.421133    0.135148
B    0.038042    1.502348    0.602624   -0.374724    0.285023    0.883823
C    0.688557    0.511833   -0.179216   -0.222458    0.854098    1.399645
D   -0.521715   -0.807464    2.030134    0.650898    1.183830   -2.291368

In [24]:
#df

Sorting by an axis

In [25]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06  0.135148  0.883823  1.399645 -2.291368
2013-01-05  0.421133  0.285023  0.854098  1.183830
2013-01-04  0.161289 -0.374724 -0.222458  0.650898
2013-01-03 -1.250384  0.602624 -0.179216  2.030134
2013-01-02 -0.839044  1.502348  0.511833 -0.807464
2013-01-01 -0.067575  0.038042  0.688557 -0.521715

In [26]:
#df.sort_values

Sorting by values

In [27]:
df.sort_values(by='B' , ascending=False)

                   A         B         C         D
2013-01-02 -0.839044  1.502348  0.511833 -0.807464
2013-01-06  0.135148  0.883823  1.399645 -2.291368
2013-01-03 -1.250384  0.602624 -0.179216  2.030134
2013-01-05  0.421133  0.285023  0.854098  1.183830
2013-01-01 -0.067575  0.038042  0.688557 -0.521715
2013-01-04  0.161289 -0.374724 -0.222458  0.650898

In [28]:
df.sort_values(by='2013-01-06' , ascending=False, axis=1)

                   C         B         A         D
2013-01-01  0.688557  0.038042 -0.067575 -0.521715
2013-01-02  0.511833  1.502348 -0.839044 -0.807464
2013-01-03 -0.179216  0.602624 -1.250384  2.030134
2013-01-04 -0.222458 -0.374724  0.161289  0.650898
2013-01-05  0.854098  0.285023  0.421133  1.183830
2013-01-06  1.399645  0.883823  0.135148 -2.291368

In [29]:
type(df)

pandas.core.frame.DataFrame

In [30]:
type(s)

pandas.core.series.Series

## Selection

**Note:** While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, the optimized pandas data access methods, `.at`, `.iat`, `.loc`, `.iloc` and `.ix` are recommended.

See the indexing documentation [Indexing and Selecting Data](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing) and [MultiIndex / Advanced Indexing](http://pandas.pydata.org/pandas-docs/stable/advanced.html#advanced)

### Getting

Selecting a single column, which yields a `Series`, equivalent to `df.A`

In [31]:
df

                   A         B         C         D
2013-01-01 -0.067575  0.038042  0.688557 -0.521715
2013-01-02 -0.839044  1.502348  0.511833 -0.807464
2013-01-03 -1.250384  0.602624 -0.179216  2.030134
2013-01-04  0.161289 -0.374724 -0.222458  0.650898
2013-01-05  0.421133  0.285023  0.854098  1.183830
2013-01-06  0.135148  0.883823  1.399645 -2.291368

In [32]:
df['A']

2013-01-01   -0.067575
2013-01-02   -0.839044
2013-01-03   -1.250384
2013-01-04    0.161289
2013-01-05    0.421133
2013-01-06    0.135148
Freq: D, Name: A, dtype: float64

In [33]:
type(df["A"])

pandas.core.series.Series

In [34]:
df.A

2013-01-01   -0.067575
2013-01-02   -0.839044
2013-01-03   -1.250384
2013-01-04    0.161289
2013-01-05    0.421133
2013-01-06    0.135148
Freq: D, Name: A, dtype: float64

Selecting via [], which slices the rows.

In [35]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.067575  0.038042  0.688557 -0.521715
2013-01-02 -0.839044  1.502348  0.511833 -0.807464
2013-01-03 -1.250384  0.602624 -0.179216  2.030134

In [36]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.839044  1.502348  0.511833 -0.807464
2013-01-03 -1.250384  0.602624 -0.179216  2.030134
2013-01-04  0.161289 -0.374724 -0.222458  0.650898

### Selecting by Label

See more in [Selection by Label](http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-label)

For getting a cross section using a label

In [37]:
?df.loc

In [38]:
dates[0]

Timestamp('2013-01-01 00:00:00', freq='D')

In [39]:
dates[0:4]

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04'], dtype='datetime64[ns]', freq='D')

In [98]:
df.loc[dates[0:4]]

                   A         B         C         D
2013-01-01  0.430836  0.462817 -1.112833  0.477462
2013-01-02 -0.407161 -0.332588  1.365704  0.178716
2013-01-03 -0.670012  0.518603 -1.183840 -2.611754
2013-01-04 -2.195315 -0.335308  0.263239 -0.638686

Selecting on a multi-axis by label

In [99]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.430836  0.462817
2013-01-02 -0.407161 -0.332588
2013-01-03 -0.670012  0.518603
2013-01-04 -2.195315 -0.335308
2013-01-05  0.590392 -1.424858
2013-01-06 -1.188601  0.547093

Showing label slicing, both endpoints are included

In [100]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.407161 -0.332588
2013-01-03 -0.670012  0.518603
2013-01-04 -2.195315 -0.335308

Reduction in the dimensions of the returned object

In [43]:
df.loc['20130102',['A','B']]

A   -0.839044
B    1.502348
Name: 2013-01-02 00:00:00, dtype: float64

For getting a scalar value

In [44]:
df.loc[dates[0],'A']

-0.06757528122399717

For getting fast access to a scalar (equiv to the prior method)

In [45]:
df.at[dates[0],'A']

-0.06757528122399717

### Selection by position

Pandas provides a suite of methods in order to get purely integer based indexing. The semantics follow closely python and numpy slicing. These are 0-based indexing. When slicing, the start bounds is included, while the upper bound is excluded. Trying to use a non-integer, even a valid label will raise an IndexError.

The .iloc attribute is the primary access method. The following are valid inputs:

    An integer e.g. 5
    A list or array of integers [4, 3, 0]
    A slice object with ints 1:7
    A boolean array
    A callable, see Selection By Callable

In [46]:
df

                   A         B         C         D
2013-01-01 -0.067575  0.038042  0.688557 -0.521715
2013-01-02 -0.839044  1.502348  0.511833 -0.807464
2013-01-03 -1.250384  0.602624 -0.179216  2.030134
2013-01-04  0.161289 -0.374724 -0.222458  0.650898
2013-01-05  0.421133  0.285023  0.854098  1.183830
2013-01-06  0.135148  0.883823  1.399645 -2.291368

Select via the position of the passed integers

In [47]:
df.iloc[3]

A    0.161289
B   -0.374724
C   -0.222458
D    0.650898
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python

In [48]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.161289 -0.374724
2013-01-05  0.421133  0.285023

By lists of integer position locations, similar to the numpy/python style

In [49]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.839044  0.511833
2013-01-03 -1.250384 -0.179216
2013-01-05  0.421133  0.854098

For slicing rows explicitly

In [50]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -0.839044  1.502348  0.511833 -0.807464
2013-01-03 -1.250384  0.602624 -0.179216  2.030134

For slicing columns explicitly

In [51]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.038042  0.688557
2013-01-02  1.502348  0.511833
2013-01-03  0.602624 -0.179216
2013-01-04 -0.374724 -0.222458
2013-01-05  0.285023  0.854098
2013-01-06  0.883823  1.399645

For getting a value explicitly

In [52]:
df.iloc[1,1]

1.5023475654353704

For getting fast access to a scalar (equiv to the prior method)

In [53]:
df.iat[1,1]

1.5023475654353704

### Boolean Indexing

Using a single column’s values to select data.

In [54]:
df[df.A > 0]

                   A         B         C         D
2013-01-04  0.161289 -0.374724 -0.222458  0.650898
2013-01-05  0.421133  0.285023  0.854098  1.183830
2013-01-06  0.135148  0.883823  1.399645 -2.291368

A `where` operation for getting.

In [55]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.038042  0.688557       NaN
2013-01-02       NaN  1.502348  0.511833       NaN
2013-01-03       NaN  0.602624       NaN  2.030134
2013-01-04  0.161289       NaN       NaN  0.650898
2013-01-05  0.421133  0.285023  0.854098  1.183830
2013-01-06  0.135148  0.883823  1.399645       NaN

In [56]:
np.nan==None

False

In [57]:
np.nan==np.nan

False

In [58]:
np.isnan(np.nan)

True

### Using the isin() method for filtering:

Series.isin(values)
Return a boolean Series showing whether each element in the Series is exactly contained in the passed sequence of values.
    
    
Parameters:	

values : set or list-like: The sequence of values to test. Passing in a single string will raise a TypeError. Instead, turn a single string into a list of one element.

  
Returns: isin : Series (bool dtype)

Raises:	TypeError: If values is a string

In [59]:
df2 = df.copy()

In [60]:
df2

                   A         B         C         D
2013-01-01 -0.067575  0.038042  0.688557 -0.521715
2013-01-02 -0.839044  1.502348  0.511833 -0.807464
2013-01-03 -1.250384  0.602624 -0.179216  2.030134
2013-01-04  0.161289 -0.374724 -0.222458  0.650898
2013-01-05  0.421133  0.285023  0.854098  1.183830
2013-01-06  0.135148  0.883823  1.399645 -2.291368

In [61]:
df2['E'] = ['one', 'one','two','three','four','three']

In [62]:
df2

                   A         B         C         D      E
2013-01-01 -0.067575  0.038042  0.688557 -0.521715    one
2013-01-02 -0.839044  1.502348  0.511833 -0.807464    one
2013-01-03 -1.250384  0.602624 -0.179216  2.030134    two
2013-01-04  0.161289 -0.374724 -0.222458  0.650898  three
2013-01-05  0.421133  0.285023  0.854098  1.183830   four
2013-01-06  0.135148  0.883823  1.399645 -2.291368  three

In [63]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [64]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.250384  0.602624 -0.179216  2.030134   two
2013-01-05  0.421133  0.285023  0.854098  1.183830  four

In [65]:
df2[(df2["A"]>1) | (df2['E'].isin(['two','four']))]

                   A         B         C         D     E
2013-01-03 -1.250384  0.602624 -0.179216  2.030134   two
2013-01-05  0.421133  0.285023  0.854098  1.183830  four

In [66]:
df2[(df2["A"]>1) & (df2['E'].isin(['two','four']))]

Empty DataFrame
Columns: [A, B, C, D, E]
Index: []

### Setting

Setting a new column automatically aligns the data by the indexes

In [67]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [68]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [69]:
df['F'] = s1

In [70]:
df

                   A         B         C         D    F
2013-01-01 -0.067575  0.038042  0.688557 -0.521715  NaN
2013-01-02 -0.839044  1.502348  0.511833 -0.807464  1.0
2013-01-03 -1.250384  0.602624 -0.179216  2.030134  2.0
2013-01-04  0.161289 -0.374724 -0.222458  0.650898  3.0
2013-01-05  0.421133  0.285023  0.854098  1.183830  4.0
2013-01-06  0.135148  0.883823  1.399645 -2.291368  5.0

Setting values by label

In [71]:
df.at[dates[0],'A'] = 0

In [72]:
dates[0]

Timestamp('2013-01-01 00:00:00', freq='D')

In [73]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.038042  0.688557 -0.521715  NaN
2013-01-02 -0.839044  1.502348  0.511833 -0.807464  1.0
2013-01-03 -1.250384  0.602624 -0.179216  2.030134  2.0
2013-01-04  0.161289 -0.374724 -0.222458  0.650898  3.0
2013-01-05  0.421133  0.285023  0.854098  1.183830  4.0
2013-01-06  0.135148  0.883823  1.399645 -2.291368  5.0

Setting values by position

In [74]:
df.iat[0,1] = 0

In [75]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.688557 -0.521715  NaN
2013-01-02 -0.839044  1.502348  0.511833 -0.807464  1.0
2013-01-03 -1.250384  0.602624 -0.179216  2.030134  2.0
2013-01-04  0.161289 -0.374724 -0.222458  0.650898  3.0
2013-01-05  0.421133  0.285023  0.854098  1.183830  4.0
2013-01-06  0.135148  0.883823  1.399645 -2.291368  5.0

Setting by assigning with a numpy array

In [76]:
df.loc[:,'D'] = np.array([5] * len(df))

In [77]:
np.array([5] * len(df))

array([5, 5, 5, 5, 5, 5])

The result of the prior setting operations

In [78]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.688557  5  NaN
2013-01-02 -0.839044  1.502348  0.511833  5  1.0
2013-01-03 -1.250384  0.602624 -0.179216  5  2.0
2013-01-04  0.161289 -0.374724 -0.222458  5  3.0
2013-01-05  0.421133  0.285023  0.854098  5  4.0
2013-01-06  0.135148  0.883823  1.399645  5  5.0

A `where` operation with setting.

## Missing Data

pandas primarily uses the value np.nan to represent missing data. It is by default not included in computations. 

By “missing” we simply mean NA (“not available”) or “not present for whatever reason”. Many data sets simply arrive with missing data, either because it exists and was not collected or it never existed. For example, in a collection of financial time series, some of the time series might start on different dates. Thus, values prior to the start date would generally be marked as missing.

In pandas, one of the most common ways that missing data is introduced into a data set is by reindexing.

Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [79]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.688557  5  NaN
2013-01-02 -0.839044  1.502348  0.511833  5  1.0
2013-01-03 -1.250384  0.602624 -0.179216  5  2.0
2013-01-04  0.161289 -0.374724 -0.222458  5  3.0
2013-01-05  0.421133  0.285023  0.854098  5  4.0
2013-01-06  0.135148  0.883823  1.399645  5  5.0

In [80]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [81]:
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000  0.688557  5  NaN NaN
2013-01-02 -0.839044  1.502348  0.511833  5  1.0 NaN
2013-01-03 -1.250384  0.602624 -0.179216  5  2.0 NaN
2013-01-04  0.161289 -0.374724 -0.222458  5  3.0 NaN

In [82]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [83]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.688557  5  NaN  1.0
2013-01-02 -0.839044  1.502348  0.511833  5  1.0  1.0
2013-01-03 -1.250384  0.602624 -0.179216  5  2.0  NaN
2013-01-04  0.161289 -0.374724 -0.222458  5  3.0  NaN

To drop any rows that have missing data.

In [84]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.839044  1.502348  0.511833  5  1.0  1.0

In [85]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.688557  5  NaN  1.0
2013-01-02 -0.839044  1.502348  0.511833  5  1.0  1.0
2013-01-03 -1.250384  0.602624 -0.179216  5  2.0  NaN
2013-01-04  0.161289 -0.374724 -0.222458  5  3.0  NaN

Filling missin data

In [86]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.688557  5  5.0  1.0
2013-01-02 -0.839044  1.502348  0.511833  5  1.0  1.0
2013-01-03 -1.250384  0.602624 -0.179216  5  2.0  5.0
2013-01-04  0.161289 -0.374724 -0.222458  5  3.0  5.0

To get the boolean mask where values are `nan`

In [87]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operations

Flexible binary operations

With binary operations between pandas data structures, there are two key points of interest:

(a) Broadcasting behavior between higher- (e.g. DataFrame) and lower-dimensional (e.g. Series) objects.

(b) Missing data in computations

Matching / broadcasting behavior

DataFrame has the methods add(), sub(), mul(), div() and related functions radd(), rsub(), etc., for carrying out binary operations. For broadcasting behavior, Series input is of primary interest. Using these functions, you can use to either match on the index or columns via the axis keyword:

### Stats

Operations in general exclude missing data.

Performing a descriptive statistic

In [88]:
df.mean(axis=0)

A   -0.228643
B    0.483182
C    0.508743
D    5.000000
F    3.000000
dtype: float64

In [89]:
df.sum(axis=1)

2013-01-01     5.688557
2013-01-02     7.175136
2013-01-03     6.173023
2013-01-04     7.564108
2013-01-05    10.560254
2013-01-06    12.418616
Freq: D, dtype: float64

Same operation on the other axis

In [90]:
df.mean(1)

2013-01-01    1.422139
2013-01-02    1.435027
2013-01-03    1.234605
2013-01-04    1.512822
2013-01-05    2.112051
2013-01-06    2.483723
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.

In [91]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [92]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [93]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.688557  5  NaN
2013-01-02 -0.839044  1.502348  0.511833  5  1.0
2013-01-03 -1.250384  0.602624 -0.179216  5  2.0
2013-01-04  0.161289 -0.374724 -0.222458  5  3.0
2013-01-05  0.421133  0.285023  0.854098  5  4.0
2013-01-06  0.135148  0.883823  1.399645  5  5.0

In [94]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.250384 -0.397376 -1.179216  4.0  1.0
2013-01-04 -2.838711 -3.374724 -3.222458  2.0  0.0
2013-01-05 -4.578867 -4.714977 -4.145902  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [95]:
s2 = pd.Series([1,3,5,6,8], index=[list("ABCDF")])
df.sub(s2)

TypeError: Expected tuple, got str

### Apply

Applying functions to the data

In [ ]:
df

In [ ]:
df.apply(np.cumsum)

In [ ]:
df

In [ ]:
df.apply(lambda x: x.max() - x.min())

### Histogramming

Value counts (histogramming) / Mode

The value_counts() Series method and top-level function computes a histogram of a 1D array of values. It can also be used as a function on regular arrays.

In [ ]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [ ]:
s

In [ ]:
s.value_counts()

Continuous values can be discretized using the cut() (bins based on values) and qcut() (bins based on sample quantiles) functions

In [ ]:
factor = pd.cut(s, 4)
factor

### String Methods

Series is equipped with a set of string processing methods in the `str` attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in `str` generally uses [regular expressions](https://docs.python.org/2/library/re.html) by default (and in 
some cases always uses them). See more at [Vectorized String Methods](http://pandas.pydata.org/pandas-docs/stable/text.html#text-string-methods).

In [ ]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [ ]:
s

In [ ]:
s.str.lower()

In [ ]:
s.str[:1]

## Merge

pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

Merge, join, and concatenate: pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.


Concatenating objects: The concat function (in the main pandas namespace) does all of the heavy lifting of performing concatenation operations along an axis while performing optional set logic (union or intersection) of the indexes (if any) on the other axes.

Concatenating pandas objects together with [concat()](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.concat.html#pandas.concat):

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4))

In [ ]:
df

In [ ]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]

In [ ]:
pieces

In [ ]:
pd.concat(pieces)

### Join

SQL style merges. See the [Database style joining](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-join)

In [ ]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [ ]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [ ]:
left

In [ ]:
right

In [ ]:
pd.merge(left, right, on='key')

Another example that can be given is:

In [ ]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

In [ ]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [ ]:
left

In [ ]:
right

In [ ]:
pd.merge(left, right, on='key')

In [ ]:
?pd.merge

### Append


Append rows to a dataframe. See the [Appending](http://pandas.pydata.org/pandas-docs/stable/merging.html#merging-concatenation)

In [ ]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [ ]:
df

In [ ]:
s = df.iloc[3]

In [ ]:
s

In [ ]:
df=df.append(s, ignore_index=False)
df

In [ ]:
df

## Grouping

By “group by” we are referring to a process involving one or more of the following steps

 * **Splitting** the data into groups based on some criteria
 * **Applying** a function to each group independently
 * **Combining** the results into a data structure

See the [Grouping section](http://pandas.pydata.org/pandas-docs/stable/groupby.html#groupby)

In [ ]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})

In [ ]:
df

Grouping and then applying a function `sum` to the resulting groups.

In [ ]:
df.groupby('A').sum()

Grouping by multiple columns forms a hierarchical index, which we then apply the function.

In [ ]:
df.groupby(['A','B']).sum()

## Reshaping

(a) Hierarchical indexing (MultiIndex)

Hierarchical / Multi-level indexing is very exciting as it opens the door to some quite sophisticated data analysis and manipulation, especially for working with higher dimensional data. In essence, it enables in storing and manipulating data with an arbitrary number of dimensions in lower dimensional data structures like Series (1d) and DataFrame (2d).

In this section, we will see what “hierarchical” indexing is and how it integrates with all of the pandas indexing functionality described above and in prior sections. 


(b) Reshaping by stacking and unstacking

Closely related to the pivot function are the related stack and unstack functions currently available on Series and DataFrame. These functions are designed to work together with MultiIndex objects. Here are essentially what these functions do:

        (1) stack: “pivot” a level of the (possibly hierarchical) column labels, returning a DataFrame with an index with a new inner-most level of row labels.
        (2) unstack: inverse operation from stack: “pivot” a level of the (possibly hierarchical) row index to the column axis, producing a reshaped DataFrame with a new inner-most level of column labels.

### Stack

In [ ]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))

In [ ]:
#import pandas as pd
tuples

In [ ]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [ ]:
?pd.MultiIndex

In [ ]:
#import numpy as np
index

In [ ]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

In [ ]:
df2 = df[:4]

In [ ]:
df2

The [stack()](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.stack.html#pandas.DataFrame.stack) method “compresses” a level in the DataFrame’s columns.

In [ ]:
stacked = df2.stack()

In [ ]:
stacked

With a “stacked” DataFrame or Series (having a `MultiIndex` as the `index`), the inverse operation of [stack()](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.stack.html#pandas.DataFrame.stack) is [unstack()](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.unstack.html#pandas.DataFrame.unstack), which by default unstacks the last level:

In [ ]:
stacked.unstack()

In [ ]:
stacked.unstack(1)

In [ ]:
stacked.unstack(0)

### Pivot Tables

Pivot tables

While pivot provides general purpose pivoting of DataFrames with various data types (strings, numerics, etc.), Pandas also provides the pivot_table function for pivoting with aggregation of numeric data.

The function pandas.pivot_table can be used to create spreadsheet-style pivot tables. See the cookbook for some advanced strategies


It takes a number of arguments

data: A DataFrame object

values: a column or a list of columns to aggregate.

index: a column, Grouper, array which has the same length as data, or list of them. Keys to group by on the pivot table index. If an array is passed, it is being used as the same manner as column values.

columns: a column, Grouper, array which has the same length as data, or list of them. Keys to group by on the pivot table column. If an array is passed, it is being used as the same manner as column values.

aggfunc: function to use for aggregation, defaulting to numpy.mean

In [ ]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
                   'B' : ['A', 'B', 'C'] * 4,
                   'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D' : np.random.randn(12),
                   'E' : np.random.randn(12)})

In [ ]:
df

We can produce pivot tables from this data very easily:

In [ ]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

In [ ]:
?pd.pivot_table

## Let Us benchmark Pandas performance

In [ ]:
#this creates a big series of random numbers
s = pd.Series(np.random.randint(0,1000,10000))
s.head()

In [ ]:
len(s)

In [ ]:
%%timeit -n 100
summary = 0
for item in s:
    summary+=item

In [ ]:
%%timeit -n 100
summary = np.sum(s)

In [ ]:
s+=2 #adds two to each item in s using broadcasting
s.head()

In [ ]:
for label, value in s.iteritems():
    s.set_value(label, value+2)
s.head()

In [ ]:
%%timeit -n 10
s = pd.Series(np.random.randint(0,1000,10000))
for label, value in s.iteritems():
    s.loc[label]= value+2

In [ ]:
%%timeit -n 10
s = pd.Series(np.random.randint(0,1000,10000))
s+=2

## Time Series / Date Functionality in Pandas

Time Series / Date functionality

pandas has proven very successful as a tool for working with time series data, especially in the financial data analysis space. Using the NumPy datetime64 and timedelta64 dtypes, we have consolidated a large number of features from other Python libraries like scikits.timeseries as well as created a tremendous amount of new functionality for manipulating time series data.

In working with time series data, we will frequently seek to:

        (a) generate sequences of fixed-frequency dates and time spans
        (b) conform or convert time series to a particular frequency
        (c) compute “relative” dates based on various non-standard time increments (e.g. 5 business days before the last business day of the year), or “roll” dates forward or backward

pandas provides a relatively compact and self-contained set of tools for performing the above tasks.

In [ ]:
import pandas as pd
import numpy as np

### Timestamp

In [ ]:
pd.Timestamp('9/1/2016 10:05AM')

### Period

In [ ]:
pd.Period('1/2016')

In [ ]:
pd.Period('3/5/2016')

### DatetimeIndex

In [ ]:
t1 = pd.Series(list('abc'), [pd.Timestamp('2016-09-01'), pd.Timestamp('2016-09-02'), pd.Timestamp('2016-09-03')])
t1

In [ ]:
t1.index

In [ ]:
type(t1.index)

### PeriodIndex

In [ ]:
t2 = pd.Series(list('def'), [pd.Period('2016-09'), pd.Period('2016-10'), pd.Period('2016-11')])
t2

In [ ]:
type(t2.index)

### Converting to Datetime

In [ ]:
d1 = ['2 June 2013', 'Aug 29, 2014', '2015-06-26', '7/12/16']
ts3 = pd.DataFrame(np.random.randint(10, 100, (4,2)), index=d1, columns=list('ab'))
ts3

In [ ]:
type(ts3.index)

In [ ]:
ts3.index = pd.to_datetime(ts3.index)
ts3

In [ ]:
pd.to_datetime('4.7.12', dayfirst=True)

In [ ]:
?pd.to_datetime

### Timedeltas

In [ ]:
pd.Timestamp('9/3/2016')-pd.Timestamp('9/1/2016')

In [ ]:
pd.Timestamp('9/2/2016 8:10AM') + pd.Timedelta('12D 3H')

### Working with Dates in a Dataframe

In [ ]:
dates = pd.date_range('10-01-2016', periods=9, freq='2W-SUN')
dates

In [ ]:
df = pd.DataFrame({'Count 1': 100 + np.random.randint(-5, 10, 9).cumsum(),
                  'Count 2': 120 + np.random.randint(-5, 10, 9)}, index=dates)
df

In [ ]:
df.index.weekday_name

In [ ]:
#df.index.month_name()

In [ ]:
df.index.day

In [ ]:
df.diff()

In [ ]:
df.resample('M').mean()

In [ ]:
df['2017']

In [ ]:
df['2016-12']

In [ ]:
df['2016-12':]

## Categoricals

Categorical Data

Categoricals are a pandas data type, which correspond to categorical variables in statistics: a variable, which can take on only a limited, and usually fixed, number of possible values (categories; levels in R). Examples are gender, social class, blood types, country affiliations, observation time or ratings via Likert scales.

In contrast to statistical categorical variables, categorical data might have an order (e.g. ‘strongly agree’ vs ‘agree’ or ‘first observation’ vs. ‘second observation’), but numerical operations (additions, divisions, ...) are not possible.

All values of categorical data are either in categories or np.nan. Order is defined by the order of categories, not lexical order of the values. Internally, the data structure consists of a categories array and an integer array of codes which point to the real value in the categories array.

The categorical data type is useful in the following cases:

    (a) A string variable consisting of only a few different values. Converting such a string variable to a categorical variable will save some memory, see here.
    (b) The lexical order of a variable is not the same as the logical order (“one”, “two”, “three”). By converting to a categorical and specifying an order on the categories, sorting and min/max will use the logical order instead of the lexical order, see here.
    (c) As a signal to other python libraries that this column should be treated as a categorical variable (e.g. to use suitable statistical methods or plot types).



See also [API documentation](http://pandas.pydata.org/pandas-docs/stable/api.html#api-categorical).

In [ ]:
import pandas as pd
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
df

Convert the raw grades to a categorical data type.

In [ ]:
df["grade"] = df["raw_grade"].astype("category")

In [ ]:
df["grade"]

In [ ]:
df["grade"].cat.categories

Rename the categories to more meaningful names (assigning to `Series.cat.categories` is inplace!)

In [ ]:
df["grade"].cat.categories = ["very good", "good", "very bad"]

In [ ]:
df["grade"].cat.categories

In [ ]:
df

Reorder the categories and simultaneously add the missing categories (methods under `Series .cat` return a new `Series` per default).

In [ ]:
df["grade"] = df["grade"].cat.set_categories(["very bad", "bad", "medium", "good", "very good"])

In [ ]:
df

Sorting is per order in the categories, not lexical order.

In [ ]:
df.sort_values(by="raw_grade")

Grouping by a categorical column shows also empty categories.

In [ ]:
df.groupby("grade").size()

## Plotting

[Plotting](http://pandas.pydata.org/pandas-docs/stable/visualization.html#visualization) docs.

In [ ]:
%matplotlib inline

In [ ]:
ts = pd.Series(np.random.randn(1000), index=pd.date_range('1/1/2000', periods=1000))

In [ ]:
ts = ts.cumsum()

In [ ]:
ts.plot()

On DataFrame, [plot()](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.plot.html#pandas.DataFrame.plot) is a convenience to plot all of the columns with labels:

In [ ]:
df = pd.DataFrame(np.random.randn(1000, 4), index=ts.index,
                  columns=['A', 'B', 'C', 'D'])

In [ ]:
df = df.cumsum()

In [ ]:
plt.figure(); df.plot(); plt.legend(loc='best')

## Getting Data In/Out

### CSV

Writing to CSV format

The Series and DataFrame objects have an instance method to_csv which allows storing the contents of the object as a comma-separated-values file. The function takes a number of arguments. Only the first is required.

        path_or_buf: A string path to the file to write or a StringIO
        sep : Field delimiter for the output file (default ”,”)
        na_rep: A string representation of a missing value (default ‘’)
        float_format: Format string for floating point numbers
        cols: Columns to write (default None)
        header: Whether to write out the column names (default True)
        index: whether to write row (index) names (default True)
        index_label: Column label(s) for index column(s) if desired. If None (default), and header and index are True, then the index names are used. (A sequence should be given if the DataFrame uses MultiIndex).
        mode : Python write mode, default ‘w’
        encoding: a string representing the encoding to use if the contents are non-ASCII, for python versions prior to 3
        line_terminator: Character sequence denoting line end (default ‘\n’)
        quoting: Set quoting rules as in csv module (default csv.QUOTE_MINIMAL). Note that if you have set a float_format then floats are converted to strings and csv.QUOTE_NONNUMERIC will treat them as non-numeric
        quotechar: Character used to quote fields (default ‘”’)
        doublequote: Control quoting of quotechar in fields (default True)
        escapechar: Character used to escape sep and quotechar when appropriate (default None)
        chunksize: Number of rows to write at a time
        tupleize_cols: If False (default), write as a list of tuples, otherwise write in an expanded line format suitable for read_csv
        date_format: Format string for datetime objects


[Writing to a csv file](http://pandas.pydata.org/pandas-docs/stable/io.html#io-store-in-csv)

In [ ]:
df.to_csv('foo.csv')

The two workhorse functions for reading text files (a.k.a. flat files) are read_csv() and read_table(). They both use the same parsing code to intelligently convert tabular data into a DataFrame object. See the cookbook for some advanced strategies.

[Reading from a csv file](http://pandas.pydata.org/pandas-docs/stable/io.html#io-read-csv-table)

In [ ]:
newdf=pd.read_csv('foo.csv')

In [ ]:
newdf

In [ ]:
?pd.read_csv

### HDF5

Reading and writing to [HDFStores](http://pandas.pydata.org/pandas-docs/stable/io.html#io-hdf5)

HDF5 on Wikipedia: [HDF5 Wiki](https://en.wikipedia.org/wiki/Hierarchical_Data_Format)

Writing to a HDF5 Store

In [ ]:
df.to_hdf('foo.h5','df')

Reading from a HDF5 Store

In [ ]:
pd.read_hdf('foo.h5','df')

### Excel

Excel files

The read_excel() method can read Excel 2003 (.xls) and Excel 2007+ (.xlsx) files using the xlrd Python module. The to_excel() instance method is used for saving a DataFrame to Excel. Generally the semantics are similar to working with csv data

Reading and writing to [MS Excel](http://pandas.pydata.org/pandas-docs/stable/io.html#io-excel)

Writing to an excel file

In [ ]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

Reading from an excel file

In [ ]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

In [ ]:
df.sort_values("A", ascending=False)[:3]

In [ ]:
df.nlargest(3,"A")

In [ ]:
!pip install PyTable